Tekla.Structures.Model.RebarEndDetailModifier
The RebarEndDetailModifier class represents a modifier that can modify the characteristics of Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
It can modify reinforcing bar end properties and will therefore affect the end of the reinforcing bars it is nearest to.
The following example shows how to create and add a RebarEndDetailModifier, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarEndDetailModifier.
var strip = new RebarEndDetailModifier();
strip.Father = rebarSet;
strip.EndType = RebarEndDetailModifier.EndTypeEnum.HOOK;
strip.RebarHook.Shape = RebarHookData.RebarHookShapeEnum.HOOK_90_DEGREES;
strip.RebarThreading.ThreadingType = "ThreadingType1";
strip.RebarThreading.Length = 100;
strip.RebarThreading.ExtraFabricationLength = 50;
strip.Curve.AddContourPoint(new ContourPoint(new Point(0, 200, 500), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(0,1000, 500), null));
strip.Insert();
}
}

Tekla.Structures.Model.RebarEndDetailModifier.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarEndDetailModifier class.

Tekla.Structures.Model.RebarEndDetailModifier.RebarHook
Gets or sets the reinforcing bar hook data.

Tekla.Structures.Model.RebarEndDetailModifier.RebarThreading
Gets or sets the reinforcing bar threading data.

Tekla.Structures.Model.RebarEndDetailModifier.RebarLengthAdjustment
Gets or sets the reinforcing bar length adjustment data.

Tekla.Structures.Model.RebarEndDetailModifier.RebarCranking
Gets or sets the rebar cranking.

Tekla.Structures.Model.RebarEndDetailModifier.EndType
Gets or sets the end type.

Tekla.Structures.Model.RebarEndDetailModifier.GetAffectedBars(Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum)
Gets the virtual bars affected by this modifier.
whichEnd: A value indicating which end of the bars the modifier should affect.
Returns: A Tekla.Structures.Model.ModelObjectEnumerator containing the virtual rebars of the rebar set that are affected.

Tekla.Structures.Model.RebarEndDetailModifier.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarEndDetailModifier.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarEndDetailModifier.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarEndDetailModifier.ToStruct(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The to struct method.
dotStrip: The dotRebarEndDetailStrip_t struct.

Tekla.Structures.Model.RebarEndDetailModifier.FromStruct(Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t@)
The from struct method.
dotStrip: The dotRebarEndDetailStrip_t struct.